run/primary_breakup/high_density_sphere_advection/3D/incompressible/sphere_advection_basecase/0_orig/alpha.liquid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    left
    {
        type            cyclic;
    }

    right
    {
        type            cyclic;
    }

    bottom
    {
        type            cyclic;
    }

    top
    {
        type            cyclic;
    }

    front
    {
    	 type		 cyclic;
    }
    
    back
    {
    	 type		 cyclic;
    }
}

// ************************************************************************* //
