run/primary_breakup/high_density_sphere_advection/3D/incompressible/sphere_advection_basecase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2106                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    left
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          256;
        startFace       11520;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  right;
    }
    right
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          256;
        startFace       11776;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  left;
    }
    bottom
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          256;
        startFace       12032;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  top;
    }
    top
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          256;
        startFace       12288;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  bottom;
    }
    front
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          256;
        startFace       12544;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  back;
    }
    back
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          256;
        startFace       12800;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  front;
    }
)

// ************************************************************************* //
