run/primary_breakup/high_density_sphere_advection/3D/incompressible/sphere_advection_basecase/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0 0)	//0
    (1 0 0)	//1
    (1 1 0)	//2
    (0 1 0)	//3
    (0 0 1)	//4
    (1 0 1)	//5
    (1 1 1)	//6
    (0 1 1)	//7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (16 16 16) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    left
    {
        type 		cyclic;
        neighbourPatch	right;
        faces
        (
            (0 4 7 3)
        );
    }
    
    right
    {
        type		cyclic;
        neighbourPatch	left;
        faces
        (
            (2 6 5 1)
        );
    }
    
    bottom
    {
        type 		cyclic;
        neighbourPatch top;
        faces
        (
            (1 5 4 0)
        );
    }
    
    top
    {
        type 		cyclic;
        neighbourPatch	bottom;
        faces
        (
            (3 7 6 2)
        );
    }
    
    front
    {
    	 type		cyclic;
    	 neighbourPatch back;
    	 faces
    	 (
    	     (4 5 6 7)
    	 );
    }
    
    back
    {
    	type		cyclic;
    	neighbourPatch	front;
    	faces
    	(
    	     (0 3 2 1)
    	);
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
