run/primary_breakup/high_density_sphere_advection/3D/incompressible/sphere_advection_basecase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interIsoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.1;

deltaT          0.0005;

writeControl    adjustable;

writeInterval   0.01;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.2;

maxAlphaCo      0.2;

maxDeltaT       0.01;


functions
{
    
    shapeConservation
    {
    	type		shapeConservationVOF;
    	libs		(myFieldFunctionObjects);
    	writeControl	onEnd;

    	fields		("alpha.liquid");
    	
    	location	true;
    }
    
    volumeConservation
    {
    	type		volumeConservationVOF;
    	libs		(myFieldFunctionObjects);
    	writeControl	writeTime;
    	
    	fields		("alpha.liquid");
    	
    	location	true;
    }
    
    normKineticEnergy
    {
    	type		normalizedKineticEnergy;
    	libs		(myFieldFunctionObjects);
    	writeControl	writeTime;
    	
    	fields		("U");
    	
    }
    
    /*surfaces
    {
        type            surfaces;
        libs            (geometricVoF sampling);
        writeControl    writeTime;

        surfaceFormat   vtp;
        fields          (alpha.liquid);

        interpolationScheme cell;

        surfaces
        {
            freeSurf
            {
                type            interface;
                interpolate     false;
            }
        }
    }*/
}

// ************************************************************************* //
